package data

enum class InfoData(val art: String, val nameDetail: String?, val size: String?, val figure: String?) {
    NUMBER_1("ЗВТ86.103К-02", "Шкив", "D внешний х D внутренний, 140x50, мм", "ЗВТ 86.103К-02.pdf"),
    NUMBER_2("СВМ.37.060", "Кронштейн для установки датчика температуры", "ДхШхВ, 60х60х60, мм", "СВМ.37.060.pdf"),
    NUMBER_3("СВП-120.00.060", null, null, null),
    NUMBER_4("СВП120.42.020", "Шкив", "Диаметр х Высота, 79x58.7, мм", "СВП120.42.020.pdf"),
    NUMBER_5("СВП120.42.030", "Шкив", "Диаметр х Высота, 150x58.7, мм", "СВП120.42.030.pdf"),
    NUMBER_6("СВM.37.060А", "Кронштейн для крепления датчика температуры", "ДхШхВ, 77.18х70х41.18, мм", "СВМ.37.060А.pdf"),
    NUMBER_7("СК20.01.01.01.406", "Кронштейн", "ДхШхВ, 100x84х48, мм", "СК20.01.01.01.406.pdf"),
    NUMBER_8("СК20.01.01.02.402", "Кронштейн", "ДхШхВ, 200x80х53, мм", "СК20.01.01.02.402.pdf"),
    NUMBER_9("СК30.01.01.02.402", "Кронштейн", "ДхШхВ, 200x80х53, мм", "СК30.01.01.02.402.pdf"),
    NUMBER_10("СК30.01.01.03.403", "Фланец", "ДхШхВ, 246x93х40, мм", "СК30.01.01.03.403.pdf"),
    NUMBER_11("СК50.01.01.404", null, "ДхШхВ, 200x100х150, мм", "СК50.01.01.404.pdf"),
    NUMBER_12("СК50.02.01.411", "Фланец", "ДхШхВ, 120x65х45, мм", "СК50.02.01.411.pdf"),
    NUMBER_13("СПО250.14.190", null, null, null),
    NUMBER_14("CS150.01.427-01", "Cтенка", "ДхШхВ, 390x200х40, мм", "CS150.01.427-01 (чертеж зеркально отраженный).pdf"),
    NUMBER_15("GS120.01.413", "Опора актуатора", "ДхШхВ, 137x100х80, мм", "GS120.01.413.pdf"),
    NUMBER_16("GS120.07.442", "Кронштейн", "ДхШхВ, 227x80х95, мм", "GS120.07.442.pdf"),
    NUMBER_17("SU80.01.426", "Кронштейн", "ДхШ, 148x100, мм", "SU80.01.426.pdf"),
    NUMBER_18("SU80.10.409A", "Ушко", "ДхШхВ, 200x60х150, мм", "SU80.10.409А.pdf"),
    NUMBER_19("SU160.00.404", "Кронштейн", "ДхШ, 135.3x120, мм", "SU160.00.404.pdf"),
}